МедИнтеграция/src/Catalogs/Пациенты/Пациенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пациенты</name>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.Пол</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолисОМС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Клиника</name>
    <type>
      <types>CatalogRef.Клиники</types>
    </type>
  </attributes>
</mdclass:Catalog>

МедИнтеграция/src/HTTPServices/MedAPI/Module.bsl
Функция ClinicReportGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция OrderStatusPUT(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция OrderByIdGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция OrdersGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция ServicesGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция OrdersPOST(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции

Функция PatientsGET(Запрос)
	Попытка
		
		ИД = Запрос.ПараметрыURL["id"];
		Пациент = Справочники.Пациенты.НайтиПоКоду(ИД);
		Если Пациент.Пустая() Тогда
			Возврат ОтветОшибки(404, "not_found", "Пациент не найден");
		КонецЕсли;
		
		Данные = Новый Структура;
		Данные.Вставить("id",        Пациент.Код);
		Данные.Вставить("name",      Пациент.Наименование);
		Данные.Вставить("birthdate", Формат(Пациент.ДатаРождения, "ДФ=yyyy-MM-dd"));
		Данные.Вставить("gender",    Строка(Пациент.Пол));
		Данные.Вставить("phone",     Пациент.Телефон);
		Данные.Вставить("policy",    Пациент.ПолисОМС);
		Данные.Вставить("clinic",    Строка(Пациент.Клиника));
		
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(ВСтрокуJSON(Данные));
		Возврат Ответ;
	Исключение
		Возврат ОтветОшибки(500,"internal_error" , ОписаниеОшибки());
	КонецПопытки;
	
			
КонецФункции

Функция ВСтрокуJSON(Данные)

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция ОтветОшибки(КодHTTP, КодОшибки, Сообщение)
	Данные = Новый Структура;
	Данные.Вставить("error", КодОшибки);
	Данные.Вставить("message", Сообщение);
	
	Ответ = Новый HTTPСервисОтвет(КодHTTP);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(ВСтрокуJSON(Данные));
	Возврат Ответ;
		
КонецФункции
